labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
}

/****************************************************************
*FUNCTION NAME:getLastCommand
*FUNCTION     :getLastCommand 
*INPUT        :IMEI
*OUTPUT       :void
****************************************************************/
void  LIB_SIM800C::getLastCommand(void)
{
   sim800c.sendAtCommand("A/",200, 0);
   //RESPONSE CANT BE DETERMINED
}

/****************************************************************
*FUNCTION NAME:getCurrentConfig
*FUNCTION     :getCurrentConfig 
*INPUT        :IMEI
*OUTPUT       :void
****************************************************************/
void  LIB_SIM800C::getCurrentConfig(void)
{
  sim800c.sendAtCommand("AT&V0\r\n",200,0);

  debugTerminal("Sim80x_setFactoryDefault");

  //update
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer)); 

  
}

/****************************************************************
*FUNCTION NAME:getTaCapabilities
*FUNCTION     :getTaCapabilities 
*INPUT        :IMEI
*OUTPUT       :void
****************************************************************/
void  LIB_SIM800C::getTaCapabilities(void)
{
  sim800c.sendAtCommand("AT+GCAP\r\n",200,0);

  debugTerminal("Sim80x_getTaCapabilities");

  //update
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer)); 

}

/****************************************************************
*FUNCTION NAME:getIMEI
*FUNCTION     :recieve module IMEI number 
*INPUT        :IMEI
*OUTPUT       :void
****************************************************************/
void  LIB_SIM800C::getIMEI(char *IMEI)
{


  sim800c.sendAtCommand("AT+CGSN\r\n",200, 0);

  updateIMEI();
}










/****************************************************************
*FUNCTION NAME:updateManNo
*FUNCTION     :updateManNo
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::updateManNo(uint16_t addrs)
{	
	char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"AT+GMI\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"AT+GMI\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("Sim80x_getManNo");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}

/****************************************************************
*FUNCTION NAME:updateModelNo
*FUNCTION     :updateModelNo
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::updateModelNo(uint16_t addrs)
{	
	char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"AT+GMM\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"AT+GMM\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("Sim80x_getModelNo");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}//complete

/****************************************************************
*FUNCTION NAME:updateGlobalNo
*FUNCTION     :updateGlobalNo
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::updateGlobalNo(uint16_t addrs)
{	
	char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"AT+GOI\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"AT+GOI\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("Sim80x_getGlobalNo");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}

/****************************************************************
*FUNCTION NAME:updateLastCommand
*FUNCTION     :updateLastCommand
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::updateLastCommand(uint16_t addrs)
{	
	char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"A/\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"A/\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("Sim80x_getLastCommand");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}

/****************************************************************
*FUNCTION NAME:updateCurrentConfig
*FUNCTION     :updateCurrentConfig
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::updateCurrentConfig(uint16_t addrs)
{	
	char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"AT&V0\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"AT&V0\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("Sim80x_getCurrentConfig");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}

/****************************************************************
*FUNCTION NAME:updateTaCapabilities
*FUNCTION     :updateTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::updateTaCapabilities(uint16_t addrs)
{	
	char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"AT+GCAP\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"AT+GCAP\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("Sim80x_getTaCapabilities");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}








/****************************************************************
*FUNCTION NAME:updateIMEI
*FUNCTION     :updateIMEI
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::updateIMEI(uint16_t addrs)
{	
	char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"AT+CGSN\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"AT+CGSN\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("Sim80x_getIMEI");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}

/****************************************************************
*FUNCTION NAME:GSM_IRQHandler
*FUNCTION     :GSM_IRQHandler
*INPUT        :
*OUTPUT       :
****************************************************************/
//#pragma vector = USART_VECTOR
GSM_IRQHANDLER {
  
  //Sim80x.UsartRxBuffer[index] = USART_ReceiveData(GSM_USART_CH);
  //index++;
  USART_ClearITPendingBit(GSM_USART_CH, USART_IT_RXNE);

  USART_ClearFlag(GSM_USART_CH, USART_FLAG_RXNE);
}

#endif

#endif
